# üèÖ Data Science & Visualization Project  
## üìä Week 1 ‚Äì Team Formation & Data Hunting

> **Theme:** Olympic History & Geopolitics  
> **Dataset:** 120 Years of Olympic History (Athletes & Results)

---

## üåç Project Title  
#### **The Evolution of the Ultimate Olympic Athlete**  
### *Faster, Higher, Stronger*

---

## ü§ù Team Formation

Data science is not a solo sport, just like the Olympics.

For this project, our team was formed with a shared interest in:

Sports analytics üèÉ‚Äç‚ôÇÔ∏è  
Historical trends üìú  
Data-driven storytelling üìà  

### üë• Team Members

**AKHIL C ‚Äì 24BAD007**  
**KAVIYA S ‚Äì 24BAD059**  
**HAMPHIRITHA ‚Äì 24BAD403**

Each member contributes to:

Dataset understanding  
Data cleaning and exploration  
Visualization and interpretation  
Insight communication  

This collaborative approach ensures both **technical accuracy** and **strong storytelling**.

---

## üîç Data Hunting & Dataset Selection

After exploring multiple public datasets, we selected:

### üóÇ **120 Years of Olympic History ‚Äì Athletes & Results**

**Why this dataset?**

Covers Olympic Games from **1896 to 2016**  
Includes detailed **athlete-level data**  
Rich in **historical, physical, and geopolitical context**  
Highly suitable for **Exploratory Data Analysis (EDA)** and visualization  

üìå This dataset allows us to analyze how **sports performance evolves across time, nations, and physical attributes**.

---

## üß† Problem Statement

### **Olympic History & Geopolitics**

Over the last century, the Olympic Games have reflected:

Global power shifts üåê  
Technological and training advancements üß™  
Changes in athlete physique üí™  

However, raw data alone does not clearly reveal these patterns.

üëâ **Our challenge is to transform this historical data into meaningful and interpretable insights.**

---

## üéØ Project Objectives

We aim to answer the following key questions:

### üèÜ Country Dominance Over Time

Which countries dominated specific Olympic eras?  
How did geopolitical events influence medal performance?  
How has dominance shifted across decades?

### üßç‚Äç‚ôÇÔ∏è Physical Attributes of Champions

What are the height and weight patterns of gold medalists?  
Do different sports favor different body types?  
How has the ‚Äúideal athlete‚Äù evolved over time?

---

## üìñ Story We Want to Tell

> **‚ÄúFaster, Higher, Stronger‚Äù is not just a motto ‚Äî it is a data story.**

Through this project, we narrate:

The rise and fall of sporting nations  
The evolution of athletic excellence  
How data captures human performance at its peak  

üèÖ **From history to numbers, from numbers to insight.**

---

## üõ† Tools & Environment Setup

For this project:

A shared **GitHub repository** has been created üìÇ  
Version control ensures transparency, collaboration, and reproducibility  

üìì This Jupyter Notebook serves as a **living project log**, documenting the journey from raw data understanding to final insights.

---

## ‚úÖ Week 1 Outcome

By the end of Week 1, we have:

Finalized our dataset  
Clearly defined the problem statement  
Understood the project scope and objectives  
Set up a collaborative development environment  

üöÄ **Ready to dive deeper into the data in Week 2!**

---

In [11]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

---

# üìä Week 2 ‚Äì Know Your Data

> **Focus:** Data Loading and Basic Exploration

---

# üîç Dataset Loading

In Week 2, we focused on loading the Olympic dataset into the notebook and performing basic inspection.  
The dataset was successfully read into a DataFrame using Pandas.

This step helped us verify:  
The number of rows and columns  
Column names and data types  
Overall structure of the dataset  

---

In [24]:
import kagglehub

The dataset uses a non-UTF-8 encoding. Kagglehub internally assumes UTF-8 and does not expose encoding parameters, so the file must be loaded using Pandas with the correct encoding,so from kaggle we only downloaded the filepath

In [21]:
dataset_path = kagglehub.dataset_download(
    "heesoo37/120-years-of-olympic-history-athletes-and-results"
)

dataset_path

Warning: Looks like you're using an outdated `kagglehub` version (installed: 0.3.13), please consider upgrading to the latest version (0.4.1).
Downloading from https://www.kaggle.com/api/v1/datasets/download/heesoo37/120-years-of-olympic-history-athletes-and-results?dataset_version_number=2...

100%|‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà| 5.43M/5.43M [02:06<00:00, 45.1kB/s]

Extracting files...

'C:\\Users\\Akhil\\.cache\\kagglehub\\datasets\\heesoo37\\120-years-of-olympic-history-athletes-and-results\\versions\\2'

The dataset was saved using a different character encoding. Pandas assumes UTF-8 by default, which caused a decoding error. Specifying the correct encoding resolved the issue.

In [52]:
athlete_file_path = dataset_path + "/athlete_events.csv"
noc_file_path = dataset_path +"/noc_regions.csv"
df_athlete = pd.read_csv(athlete_file_path, encoding="latin1")
df_noc = pd.read_csv(noc_file_path,encoding="latin1")

---


# üëÄ First Impression of the Dataset

At first glance, the Olympic dataset is rich, well-structured, and historically significant.  
It contains detailed information about athletes, events, countries, and medal outcomes across multiple Olympic editions.

The dataset spans more than a century, allowing us to observe long-term trends in performance and participation.  
Numerical attributes such as age, height, and weight appear useful for analyzing athlete characteristics, while categorical fields provide strong context for sports, teams, and medals.

Some columns contain missing values, which is expected in historical data collected over many years.  
Overall, the dataset provides a strong foundation for exploring Olympic dominance and the evolution of athletic performance.

---

In [53]:
df_athlete.head()

,ID,Name,Sex,Age,Height,Weight,Team,NOC,Games,Year,Season,City,Sport,Event,Medal
0,1,A Dijiang,M,24.0,180.0,80.0,China,CHN,1992 Summer,1992,Summer,Barcelona,Basketball,Basketball Men's Basketball,NaN
1,2,A Lamusi,M,23.0,170.0,60.0,China,CHN,2012 Summer,2012,Summer,London,Judo,Judo Men's Extra-Lightweight,NaN
2,3,Gunnar Nielsen Aaby,M,24.0,NaN,NaN,Denmark,DEN,1920 Summer,1920,Summer,Antwerpen,Football,Football Men's Football,NaN
3,4,Edgar Lindenau Aabye,M,34.0,NaN,NaN,Denmark/Sweden,DEN,1900 Summer,1900,Summer,Paris,Tug-Of-War,Tug-Of-War Men's Tug-Of-War,Gold
4,5,Christine Jacoba Aaftink,F,21.0,185.0,82.0,Netherlands,NED,1988 Winter,1988,Winter,Calgary,Speed Skating,Speed Skating Women's 500 metres,NaN

In [61]:
df_noc.tail()

     NOC    region        notes
225  YEM     Yemen          NaN
226  YMD     Yemen  South Yemen
227  YUG    Serbia   Yugoslavia
228  ZAM    Zambia          NaN
229  ZIM  Zimbabwe          NaN

In [56]:
df_noc.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 230 entries, 0 to 229
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   NOC     230 non-null    object
 1   region  227 non-null    object
 2   notes   21 non-null     object
dtypes: object(3)
memory usage: 5.5+ KB

In [57]:
df_athlete.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 271116 entries, 0 to 271115
Data columns (total 15 columns):
 #   Column  Non-Null Count   Dtype
---  ------  --------------   -----
 0   ID      271116 non-null  int64
 1   Name    271116 non-null  object
 2   Sex     271116 non-null  object
 3   Age     261642 non-null  float64
 4   Height  210945 non-null  float64
 5   Weight  208241 non-null  float64
 6   Team    271116 non-null  object
 7   NOC     271116 non-null  object
 8   Games   271116 non-null  object
 9   Year    271116 non-null  int64
 10  Season  271116 non-null  object
 11  City    271116 non-null  object
 12  Sport   271116 non-null  object
 13  Event   271116 non-null  object
 14  Medal   39783 non-null   object
dtypes: float64(3), int64(2), object(10)
memory usage: 31.0+ MB

In [58]:
df_athlete.describe()

,ID,Age,Height,Weight,Year
count,271116.000000,261642.000000,210945.000000,208241.000000,271116.000000
mean,68248.954396,25.556898,175.338970,70.702393,1978.378480
std,39022.286345,6.393561,10.518462,14.348020,29.877632
min,1.000000,10.000000,127.000000,25.000000,1896.000000
25%,34643.000000,21.000000,168.000000,60.000000,1960.000000
50%,68205.000000,24.000000,175.000000,70.000000,1988.000000
75%,102097.250000,28.000000,183.000000,79.000000,2002.000000
max,135571.000000,97.000000,226.000000,214.000000,2016.000000

In [59]:
df_noc.describe()

        NOC   region                 notes
count   230      227                    21
unique  230      206                    21
top     AFG  Germany  Netherlands Antilles
freq      1        4                     1

In [65]:
print("The Rows and Columns :\n\n ATHLETES        NOC")
df_athlete.shape,df_noc.shape

The Rows and Columns :

 ATHLETES        NOC

((271116, 15), (230, 3))

---



To add a second dataset to a main DataFrame,we can use merge when both datasets share a common key. merge is preferred in relational datasets because it preserves data integrity.

When working with multiple datasets, the `merge()` function is used when both datasets share a common column (key).  

In our dataset both dataframe contains common key i.e 'NOC'

This key helps combine related information from different sources into a single DataFrame.


---

In [66]:
df=pd.merge(df_athlete, df_noc, on="NOC", how="left")

---

# üß™ Initial Data Understanding

Basic functions were used to understand the dataset:

`info()` was used to inspect data types and non-null values  
`describe()` provided statistical summaries of numerical features  
`isnull().sum()` helped identify missing values  
`duplicated().sum()` helped identify duplicate values  

These steps gave us a clear first impression of the data without modifying it.

---

In [67]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 271116 entries, 0 to 271115
Data columns (total 17 columns):
 #   Column  Non-Null Count   Dtype
---  ------  --------------   -----
 0   ID      271116 non-null  int64
 1   Name    271116 non-null  object
 2   Sex     271116 non-null  object
 3   Age     261642 non-null  float64
 4   Height  210945 non-null  float64
 5   Weight  208241 non-null  float64
 6   Team    271116 non-null  object
 7   NOC     271116 non-null  object
 8   Games   271116 non-null  object
 9   Year    271116 non-null  int64
 10  Season  271116 non-null  object
 11  City    271116 non-null  object
 12  Sport   271116 non-null  object
 13  Event   271116 non-null  object
 14  Medal   39783 non-null   object
 15  region  270746 non-null  object
 16  notes   5039 non-null    object
dtypes: float64(3), int64(2), object(12)
memory usage: 35.2+ MB

In [68]:
df.describe()

,ID,Age,Height,Weight,Year
count,271116.000000,261642.000000,210945.000000,208241.000000,271116.000000
mean,68248.954396,25.556898,175.338970,70.702393,1978.378480
std,39022.286345,6.393561,10.518462,14.348020,29.877632
min,1.000000,10.000000,127.000000,25.000000,1896.000000
25%,34643.000000,21.000000,168.000000,60.000000,1960.000000
50%,68205.000000,24.000000,175.000000,70.000000,1988.000000
75%,102097.250000,28.000000,183.000000,79.000000,2002.000000
max,135571.000000,97.000000,226.000000,214.000000,2016.000000

In [69]:
print("The Null Values,...")
df.isnull().sum()

The Null Values,...

ID             0
Name           0
Sex            0
Age         9474
Height     60171
Weight     62875
Team           0
NOC            0
Games          0
Year           0
Season         0
City           0
Sport          0
Event          0
Medal     231333
region       370
notes     266077
dtype: int64

In [70]:
print("The Duplicated Values,...\n")
for i in df:
    print(f'{i:8}: {df[i].duplicated().sum()}')

The Duplicated Values,...

ID      : 135545
Name    : 136384
Sex     : 271114
Age     : 271041
Height  : 271020
Weight  : 270895
Team    : 269932
NOC     : 270886
Games   : 271065
Year    : 271081
Season  : 271114
City    : 271074
Sport   : 271050
Event   : 270351
Medal   : 271112
region  : 270910
notes   : 271094

---

# üìå Key Observations

The dataset contains athlete-level and event-level information.  
Some columns contain missing values that require cleaning later.  
The data is suitable for further analysis related to Olympic history and athlete attributes.

---

# ‚úÖ Week 2 Outcome

By the end of Week 2, we achieved:  
Successful data loading  
Basic understanding of dataset structure  
Identification of missing values  

üöÄ **Ready to move into data cleaning in Week 3.**


---